using UnityEngine;

namespace LOBS
{
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    //
    // GlobalEnumClass
    // 
    //
    //++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++++
    #region [Enum] ProgramStatus
    //------------------------------------------------------------------------------------------------------------------------------------------------------
    public enum ProgramStatus
    {
        Start, Playing, Pause, Stop
    }
    #endregion

    #region [Enum] Direction - UI
    /// <summary>
    /// UI 트위닝 위한 방향 
    /// </summary>
    //------------------------------------------------------------------------------------------------------------------------------------------------------
    public enum UI_Tween_Direction
    {
        X, Y, Z
    }
    #endregion
    #region [Enum] Debug Gizmo
    /// <summary>
    /// 디버그용 기즈모 종류
    /// </summary>
    //------------------------------------------------------------------------------------------------------------------------------------------------------
    public enum Gizmo_Sort
    {
        Mesh, Wire
    }
    #endregion

    #region [Enum] DataType
    /// <summary>
    /// 성능&발전 데이터 타입
    /// </summary>
    //------------------------------------------------------------------------------------------------------------------------------------------------------
    public enum DataType
    {
        Base, OperateTime, Efficiency, Temperature, Co2, Weather, FineDust, System, RealTime_watt, Day_watt, Mont_watt, ReMain_watt, Now_watt 
    }
    #endregion

    #region [Enum] SoundType
    /// <summary>
    /// 사운드 종류 : 배경음악 , 효과음 , UI 효과음
    /// </summary>
    //------------------------------------------------------------------------------------------------------------------------------------------------------
    public enum SoundType
    {
        BGM, Effect, UIEffect
    }
    #endregion

}
